case_12/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 1;
        cAlpha			1;

        MULESCorr       yes;
        nLimiterIter    3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0;
    }
    ".*(rho|rhoFinal)"
    {
        solver          diagonal;
    }
    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.01;
    }
    p_rghFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0;
    }
    "(U|T|k|epsilon|B|nuTilda).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   no;
    transonic           no;
    nOuterCorrectors    2;
    nCorrectors         4;
    nNonOrthogonalCorrectors 0;
    correctPhi          no;
    pRefCell 0;
    pRefValue 101325;

    outerCorrectorResidualControl
    {
        "(U|k|epsilon)"
        {
                tolerance	0.001;
                relTol		0;
        }
        p_rgh
        {
                tolerance	0.001;
                relTol		0;
        }
     }
}

relaxationFactors
{
	fields
	{
		p_rgh				0.9;
	}	
    equations
    {
		"(U|k|epsilon)" 	0.9;
    }
}


// ************************************************************************* //
